package telbot

const (
	msgWtf = "خطای نامشخص"

	msgMenu = "👇🏻 انتخاب کنید"

	msgAlreadyRegistered   = "شما قبلا ثبت نام کرده‌اید"
	msgNotRegisteredYet    = "شما هنوز ثبت نام نکرده‌اید"
	msgUserNotActive       = "کاربر شما غیر فعال شده است. با خرید یکی از سرویس‌های موجود کاربر شما فعال می‌شود"
	msgRegistrationFailed  = "در ثبت نام شما مشکلی به وجود آمد. لطفا با پشتیبانی تماس بگیرید"
	msgRegistrationSuccess = `سلام به زود سرور خوش آمدید!

♥️ زود سرور در کنار شماست با افزایش کیفیت و دسترسی شما به اینترنت با ویژگی های متعدد:

🔰اتصال به اینترنت بدون محدودیت حتی در زمان ملی شدن اینترنت
🔰 عبور از هرنوع تحریم خارجی
🔰 اتصال ساده در تمامی دستگاه ها ( Android - ios - Windows - Mac )
🔰 سرعت و پایداری بالا در دانلود و آپلود
🔰 کاهش تضمینی پینگ در بازی های آنلاین 
🔰آیپی ثابت. مناسب برای تریدر ها و امنیت حساب های اینستاگرامی
🔰 پشتیبانی فعال تا آخرین ثانیه
ـ`

	msgTraffic        = "ترافیک مصرفی شما %.2f گیگ است\nحد مجاز ترافیک %.0f گیگ است\n."
	msgTmpSubLink     = "لینک ساب شما:\n\n  https://api3.abaan.info/nN53MSEx3AN0O80qAJ/%s/all.txt?mode=new\n"
	msgSubLinkAndroid = "لینک ساب برای اندروید:\n"

	msgInvalidButtonCallback    = "پکیج مورد نظر یافت نشد. لطفا به پشتیبانی پیام بدهید."
	msgPackageDetailsHeader     = "👈 پکیج‌های موجود" + "\n"
	msgPackageDetailWithPicture = "-"
	msgPackageChoosePackage     = "با انتخاب یکی از پکیج‌های بالا فاکتور جدید برای شما ایجاد می‌شود:\n"
	msgPurchaseChooseMethod     = "سفارش انتخابی شما:\n\n" + "✅ %s\n" +
		"✅ مبلغ جهت پرداخت: `%s` تومان (%s ریال)\n\n\n" +
		"لطفا یکی از روش‌های پرداخت را انتخاب کنید:" + "\n" +
		"⬅️ درگاه پرداخت: به صفحه بانک منتقل می‌شوید" + "\n" +
		"⬅️ کارت به کارت: مبلغ را به شماره کارت ما ارسال کنید و فیش بفرستید"
	msgPurchaseNotification = "\n❕ New Purchase  ❕\n" +
		"Username:                   @%s\n" +
		"Telegram ID :                %d\n" +
		"Package Price:             %s Toman\n" +
		"Package Name:           %s\n"
	msgPurchaseProcessFailed       = "در فرایند خرید شما خطایی رخ داد. با پشتیبانی تماس بگیرید."
	msgPurchaseWaitPlease          = "متشکریم.\nلطف چند دقیقه صبر کنید تا پشتیبان‌ها فیش ارسالی را بررسی کنند.\nپس از تایید فیش ارسالی همینجا به شما اطلاع‌رسانی می‌شود."
	msgPhotoWithoutPurchase        = "در سیستم سفارشی برای شما ثبت نشده است. آیا قبل از ارسال عکس پکیج مورد نظر را انتخاب کرده‌اید؟"
	msgPurchaseConfirmationFailed  = "confirmation process failed: FATAL ERROR"
	msgPurchaseConfirmationSuccess = "done"
	msgPurchaseSuccess             = "✅  سفارش شما تایید شد." + "\n" +
		"از همین حالا می‌توانید از پکیج «%s» خود استفاده کنید. برای دیدن آموزش و راهنمایی از منو گزینه راهنما را انتخاب کنید." + "\n" +
		"\n\nمتشکریم"

	msgPurchaseRejected         = "با سلام،\n❌ متاسفانه سفارش شما لغو شد. لطفا با پشتیبانی تماس بگیرید."
	msgPurchaseAlreadyProcessed = "get your shit together!"

	msgYourOrder = "سفارش شما ثبت شد:\n\n" + "✅ %s\n" +
		"✅ مبلغ جهت پرداخت: `%s` تومان (%s ریال)\n\n\n" +
		"با زدن دکمه پرداخت به بانک منتقل می‌شوید\n.اگر صفحه بانک باز نشد حتما فیلترشکن خود را خاموش کنید و دوباره روی دکمه پرداخت بزنید."

	msgCard2CardNotAvailable = "در حال حاضر پرداخت از طریق کارت به کارت ممکن نمی‌باشد. لطفا از گزینه‌های دیگر استفاده کنید."
	//	--------------------------------------
	msgUserTrafficLimitReached = "با سلام،\nترافیک مصرفی شما به پایان رسیده‌است. لطفا برای تمدید پکیج یا خرید پکیج دیگر از منو گزینه سفارش را بزنید.\nمتشکریم"
)
