package telbot

const (
	msgWtf = "خطای نامشخص"

	msgAlreadyRegistered   = "شما قبلا ثبت نام کرده‌اید"
	msgNotRegisteredYet    = "شما هنوز ثبت نام نکرده‌اید"
	msgUserNotActive       = "کاربر شما غیر فعال شده است. با خرید یکی از سرویس‌های موجود کاربر شما فعال می‌شود."
	msgRegistrationFailed  = "در ثبت نام شما مشکلی به وجود آمد. لطفا با پشتیبانی تماس بگیرید"
	msgRegistrationSuccess = `سلام به زود سرور خوش آمدید!

♥️ زود سرور در کنار شماست با افزایش کیفیت و دسترسی شما به اینترنت با ویژگی های متعدد:

🔰اتصال به اینترنت بدون محدودیت حتی در زمان ملی شدن اینترنت
🔰 عبور از هرنوع تحریم خارجی
🔰 اتصال ساده در تمامی دستگاه ها ( Android - ios - Windows - Mac )
🔰 سرعت و پایداری بالا در دانلود و آپلود
🔰 کاهش تضمینی پینگ در بازی های آنلاین 
🔰آیپی ثابت. مناسب برای تریدر ها و امنیت حساب های اینستاگرامی
🔰 پشتیبانی فعال تا آخرین ثانیه
ـ`

	msgTraffic        = "ترافیک مصرفی شما %.2f گیگ است\nحد مجاز ترافیک %.0f گیگ است\n."
	msgTmpSubLink     = "لینک ساب شما:\n\n  https://api3.abaan.info/nN53MSEx3AN0O80qAJ/%s/all.txt?mode=new\n"
	msgSubLinkAndroid = "لینک ساب برای اندروید:\n"

	msgInvalidButtonCallback    = "پکیج مورد نظر یافت نشد. لطفا به پشتیبانی پیام بدهید."
	msgPackageDetailsHeader     = "👈 پکیج‌های موجود" + "\n"
	msgPackageDetailWithPicture = "جزییات هر پکیج در تصویر بالا نوشته شده.\nبرای ثبت سفارش پکیج خود را انتخاب کنید:"

	msgPurchasePackage = "سفارش شما:\n\n" + "✅ %s\n" +
		"✅ مبلغ جهت پرداخت: %s تومان (%s ریال)\n" +
		"✅ شماره کارت:\n%s\n" +
		"ـ——————————ـ\n" +
		"لطفا مبلغ بالا را به شماره کارتی که نوشته شده واریز کرده و فیش پرداختی را (به صورت عکس) در ادامه همین پیام ارسال کنید.\nپس از پرداخت شما حداکثر تا ۱۵ دقیقه پکیج برای شما فعال می‌شود.\n."
	msgPurchaseNotification = "\n❕ New Purchase  ❕\n" +
		"Username:                   @%s\n" +
		"Telegram ID :                %d\n" +
		"Package Price:             %s Toman\n" +
		"Package Name:           %s\n"
	msgPurchaseProcessFailed       = "در فرایند خرید شما خطایی رخ داد. با پشتیبانی تماس بگیرید."
	msgPurchaseWaitPlease          = "متشکریم.\nلطف چند دقیقه صبر کنید تا پشتیبان‌ها فیش ارسالی را بررسی کنند.\nپس از تایید فیش ارسالی همینجا به شما اطلاع‌رسانی می‌شود."
	msgPhotoWithoutPurchase        = "در سیستم سفارشی برای شما ثبت نشده است. آیا قبل از ارسال عکس پکیج مورد نظر را انتخاب کرده‌اید؟"
	msgPurchaseConfirmationFailed  = "confirmation process failed: FATAL ERROR"
	msgPurchaseConfirmationSuccess = "done"
)
